ПосуточнаяАрендаКвартир/src/Documents/Бронирование/Бронирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Бронирование</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектАренды</name>
    <type>
      <types>CatalogRef.ОбъектыАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналБронирования</name>
    <type>
      <types>CatalogRef.КаналыБронирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусБронирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаСутки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСуток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ПосуточнаяАрендаКвартир/src/Documents/Бронирование/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектАрендыПриИзменении(Элемент)

    // Вызываем серверную процедуру формы,
    // которая подтянет цену из справочника в реквизит документа
    ОбновитьЦенуЗаСуткиНаСервере();

    // На клиенте только пересчитываем количество суток и стоимость
    ПересчитатьСуткиИСтоимость();

КонецПроцедуры


&НаКлиенте
Процедура ДатаЗаездаПриИзменении(Элемент)
    ПересчитатьСуткиИСтоимость();
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыездаПриИзменении(Элемент)
    ПересчитатьСуткиИСтоимость();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаЗаСуткиПриИзменении(Элемент)
    ПересчитатьСуткиИСтоимость();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЦенуЗаСуткиНаСервере()

    // Здесь мы на сервере, можно безопасно читать реквизит справочника
    Если НЕ Объект.ОбъектАренды.Пустая() Тогда
        Объект.ЦенаЗаСутки = Объект.ОбъектАренды.ЦенаЗаСутки;
    Иначе
        Объект.ЦенаЗаСутки = 0;
    КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьСуткиИСтоимость()

    Если ЗначениеЗаполнено(Объект.ДатаЗаезда)
       И ЗначениеЗаполнено(Объект.ДатаВыезда) Тогда
        
        // дата выезда должна быть позже даты заезда
        Если Объект.ДатаВыезда <= Объект.ДатаЗаезда Тогда
            Объект.КоличествоСуток = 0;
            Объект.Стоимость       = 0;
            Возврат;
        КонецЕсли;

        // Разница дат в секундах -> в сутки
        КоличествоСекунд = Объект.ДатаВыезда - Объект.ДатаЗаезда;
        Объект.КоличествоСуток = Цел(КоличествоСекунд / 86400); // 24*60*60

        // минимум 1 сутки
        Если Объект.КоличествоСуток < 1 Тогда
            Объект.КоличествоСуток = 1;
        КонецЕсли;

        // считаем стоимость
        Если ЗначениеЗаполнено(Объект.ЦенаЗаСутки) Тогда
            Объект.Стоимость = Объект.КоличествоСуток * Объект.ЦенаЗаСутки;
        Иначе
            Объект.Стоимость = 0;
        КонецЕсли;

    Иначе
        Объект.КоличествоСуток = 0;
        Объект.Стоимость       = 0;
    КонецЕсли;

КонецПроцедуры

#КонецОбласти
